IntergatedCircuits/STM32_XPD/STM32F4_XPD/inc/xpd_usart.h
/**
  ******************************************************************************
  * @file    xpd_usart.h
  * @author  Benedek Kupper
  * @version V0.1
  * @date    2017-03-27
  * @brief   STM32 eXtensible Peripheral Drivers USART Module
  *
  *  This file is part of STM32_XPD.
  *
  *  STM32_XPD is free software: you can redistribute it and/or modify
  *  it under the terms of the GNU General Public License as published by
  *  the Free Software Foundation, either version 3 of the License, or
  *  (at your option) any later version.
  *
  *  STM32_XPD is distributed in the hope that it will be useful,
  *  but WITHOUT ANY WARRANTY; without even the implied warranty of
  *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  *  GNU General Public License for more details.
  *
  *  You should have received a copy of the GNU General Public License
  *  along with STM32_XPD.  If not, see <http://www.gnu.org/licenses/>.
  */
#ifndef __XPD_USART_H_
#define __XPD_USART_H_

#include "xpd_common.h"
#include "xpd_config.h"
#include "xpd_dma.h"
/** @defgroup USART
 * @{ */

/** @defgroup USART_Common USART Common
 * @{ */

/* Determine which version of the peripheral is available */
#if   defined(USART_ISR_WUF)
#define USART_PERIPHERAL_VERSION    3
#elif defined(USART_ISR_BUSY)
#define USART_PERIPHERAL_VERSION    2
#else
#define USART_PERIPHERAL_VERSION    1
#endif

/** @defgroup USART_Common_Exported_Types USART Common Exported Types
 * @{ */

/** @brief USART stopbit selection */
typedef enum
{
    USART_STOPBITS_0p5 = 1, /*!< STOP character is 0.5 bit long */
    USART_STOPBITS_1   = 0, /*!< STOP character is 1 bit long */
    USART_STOPBITS_1p5 = 3, /*!< STOP character is 1.5 bit long */
    USART_STOPBITS_2   = 2  /*!< STOP character is 2 bit long */
}USART_StopBitsType;

/** @brief USART parity selection */
typedef enum
{
    USART_PARITY_NONE = 0, /*!< Parity bit is not used */
    USART_PARITY_EVEN = 2, /*!< Parity bit addition turns the sum of bits even */
    USART_PARITY_ODD  = 3  /*!< Parity bit addition turns the sum of bits odd */
}USART_ParityType;

/** @brief USART setup structure */
typedef struct
{
    uint32_t              BaudRate;      /*!< The USART communication baud rate */
    FunctionalState       Transmitter;   /*!< Sets the module's transmitter capacity */
    FunctionalState       Receiver;      /*!< Sets the module's receiver capacity */
    uint8_t               DataSize;      /*!< Specifies the USART frame data size in bits */
    USART_StopBitsType    StopBits;      /*!< The number of stop bits transmitted */
    FunctionalState       SingleSample;  /*!< Sets the sampling to 1/bit from default 3/bit */
    USART_ParityType      Parity;        /*!< Specifies if the last frame bit is the parity and how it is calculated */
}USART_InitType;

#if (USART_PERIPHERAL_VERSION > 1)
/** @brief USART inversion selection */
typedef enum
{
    USART_INVERT_NONE           = 0,                  /*!< No logical signals are inverted */
    USART_INVERT_TX             = USART_CR2_TXINV,    /*!< TX signal inversion is selected */
    USART_INVERT_RX             = USART_CR2_RXINV,    /*!< RX signal inversion is selected */
    USART_INVERT_DATA           = USART_CR2_DATAINV,  /*!< Data inversion is selected */
    USART_INVERT_BIT_ORDER      = USART_CR2_MSBFIRST, /*!< Bit order inversion is selected (MSB first) */
    USART_INVERT_PIN_DIRECTIONS = USART_CR2_SWAP,     /*!< TX and RX pins are swapped */
}USART_InversionType;
#endif

/** @brief USART error types */
typedef enum
{
    USART_ERROR_NONE    = 0, /*!< No error */
    USART_ERROR_PARITY  = 1, /*!< Parity error */
    USART_ERROR_NOISE   = 2, /*!< Noise error */
    USART_ERROR_FRAME   = 4, /*!< Frame format error */
    USART_ERROR_OVERRUN = 8, /*!< Overrun flag */
    USART_ERROR_DMA     = 16 /*!< DMA transfer error */
}USART_ErrorType;

/** @brief USART Handle structure */
typedef struct
{
    USART_TypeDef * Inst;                    /*!< The address of the peripheral instance used by the handle */
#ifdef USART_BB
    USART_BitBand_TypeDef * Inst_BB;         /*!< The address of the peripheral instance in the bit-band region */
#endif
    XPD_CtrlFnType ClockCtrl;                /*!< Function pointer for RCC clock control */
    struct {
        XPD_HandleCallbackType DepInit;      /*!< Callback to initialize module dependencies (GPIOs, IRQs, DMAs) */
        XPD_HandleCallbackType DepDeinit;    /*!< Callback to restore module dependencies (GPIOs, IRQs, DMAs) */
        XPD_HandleCallbackType Transmit;     /*!< Data stream transmission successful callback */
        XPD_HandleCallbackType Receive;      /*!< Data stream reception successful callback */
        XPD_HandleCallbackType Break;        /*!< LIN break detection callback */
        XPD_HandleCallbackType Idle;         /*!< Idle callback */
        XPD_HandleCallbackType ClearToSend;  /*!< Clear To Send callback */
#if defined(USE_XPD_USART_ERROR_DETECT) || defined(USE_XPD_DMA_ERROR_DETECT)
        XPD_HandleCallbackType Error;        /*!< Error callbacks */
#endif
    }Callbacks;                              /*   Handle Callbacks */
    struct {
        DMA_HandleType * Transmit;           /*!< DMA handle for data transmission */
        DMA_HandleType * Receive;            /*!< DMA handle for data reception */
    }DMA;                                    /*   DMA handle references */
    DataStreamType RxStream;                 /*!< Data reception stream */
    DataStreamType TxStream;                 /*!< Data transmission stream */
#if defined(USE_XPD_USART_ERROR_DETECT) || defined(USE_XPD_DMA_ERROR_DETECT)
    volatile USART_ErrorType Errors;         /*!< Transfer errors */
#endif
}USART_HandleType;

/** @} */

/** @defgroup USART_Common_Exported_Macros USART Common Exported Macros
 * @{ */

#ifdef USART_BB
/**
 * @brief  USART Handle initializer macro
 * @param  INSTANCE: specifies the SPI peripheral instance.
 * @param  INIT_FN: specifies the dependency initialization function to call back.
 * @param  DEINIT_FN: specifies the dependency deinitialization function to call back.
 */
#define         NEW_USART_HANDLE(INSTANCE, INIT_FN, DEINIT_FN)  \
    {.Inst = (INSTANCE), .Inst_BB = USART_BB(INSTANCE),         \
     .ClockCtrl = XPD_##INSTANCE##_ClockCtrl,                   \
     .Callbacks.DepInit   = (INIT_FN),                          \
     .Callbacks.DepDeinit = (DEINIT_FN)}

/**
 * @brief USART register bit accessing macro
 * @param HANDLE: specifies the peripheral handle.
 * @param REG: specifies the register name.
 * @param BIT: specifies the register bit name.
 */
#define         USART_REG_BIT(HANDLE, REG_NAME, BIT_NAME)       \
    ((HANDLE)->Inst_BB->REG_NAME.BIT_NAME)

#else
/**
 * @brief  USART Handle initializer macro
 * @param  INSTANCE: specifies the SPI peripheral instance.
 * @param  INIT_FN: specifies the dependency initialization function to call back.
 * @param  DEINIT_FN: specifies the dependency deinitialization function to call back.
 */
#define         NEW_USART_HANDLE(INSTANCE, INIT_FN, DEINIT_FN)  \
    {.Inst = (INSTANCE),                                        \
     .ClockCtrl = XPD_##INSTANCE##_ClockCtrl,                   \
     .Callbacks.DepInit   = (INIT_FN),                          \
     .Callbacks.DepDeinit = (DEINIT_FN)}

/**
 * @brief USART register bit accessing macro
 * @param HANDLE: specifies the peripheral handle.
 * @param REG: specifies the register name.
 * @param BIT: specifies the register bit name.
 */
#define         USART_REG_BIT(HANDLE, REG_NAME, BIT_NAME)       \
    ((HANDLE)->Inst->REG_NAME.b.BIT_NAME)

#endif /* USART_BB */

/**
 * @brief  Enable the specified USART interrupt.
 * @param  HANDLE: specifies the USART Handle.
 * @param  IT_NAME: specifies the interrupt to enable.
 *         This parameter can be one of the following values:
 *            @arg IDLE:    Idle
 *            @arg RXNE:    Receive buffer not empty
 *            @arg TC:      Transmission complete
 *            @arg TXE:     Transmit buffer empty
 *            @arg PE:      Parity error
 *            @arg E:       Noise, frame, overrun error
 *            @arg LBD:     LIN break detection
 *            @arg CTS:     Clear To Send
 *            @arg WU:      Wake Up
 */
#define         XPD_USART_EnableIT(  HANDLE,  IT_NAME)          \
    (__XPD_USART_##IT_NAME##IECtrl(HANDLE, ENABLE))

/**
 * @brief  Disable the specified USART interrupt.
 * @param  HANDLE: specifies the USART Handle.
 * @param  IT_NAME: specifies the interrupt to enable.
 *         This parameter can be one of the following values:
 *            @arg IDLE:    Idle
 *            @arg RXNE:    Receive buffer not empty
 *            @arg TC:      Transmission complete
 *            @arg TXE:     Transmit buffer empty
 *            @arg PE:      Parity error
 *            @arg E:       Noise, frame, overrun error
 *            @arg LBD:     LIN break detection
 *            @arg CTS:     Clear To Send
 *            @arg WU:      Wake Up
 */
#define         XPD_USART_DisableIT( HANDLE,  IT_NAME)          \
        (__XPD_USART_##IT_NAME##IECtrl(HANDLE, DISABLE))

/**
 * @brief  Resume the specified USART DMA requests.
 * @param  HANDLE: specifies the USART Handle.
 * @param  DMA_NAME: specifies the DMA request to resume.
 *         This parameter can be one of the following values:
 *            @arg T:       Transmit
 *            @arg R:       Receive
 */
#define         XPD_USART_EnableDMA(HANDLE, DMA_NAME)           \
    (SPI_REG_BIT((HANDLE), CR3, DMA##DMA_NAME) = 1)

/**
 * @brief  Halt the specified USART DMA requests.
 * @param  HANDLE: specifies the USART Handle.
 * @param  DMA_NAME: specifies the DMA request to halt.
 *         This parameter can be one of the following values:
 *            @arg T:       Transmit
 *            @arg R:       Receive
 */
#define         XPD_USART_DisableDMA(HANDLE, DMA_NAME)          \
    (SPI_REG_BIT((HANDLE), CR3, DMA##DMA_NAME) = 0)

#if (USART_PERIPHERAL_VERSION > 1)
/* macros for cross-compatibility */
#define USART_ICR_NECF      USART_ICR_NCF
#define USART_ISR_WU        USART_ISR_WUF
#define USART_ISR_WU_Pos    USART_ISR_WUF_Pos
#define USART_ISR_LBD       USART_ISR_LBDF
#define USART_ISR_LBD_Pos   USART_ISR_LBDF_Pos
#define USART_ICR_RXNECF    0

/**
 * @brief  Get the specified USART flag.
 * @param  HANDLE: specifies the USART Handle.
 * @param  FLAG_NAME: specifies the flag to return.
 *         This parameter can be one of the following values:
 *            @arg REACK:   Receive enable acknowledge
 *            @arg TEACK:   Transmit enable acknowledge
 *            @arg BUSY:    Busy
 *            @arg IDLE:    Idle
 *            @arg RXNE:    Receive buffer not empty
 *            @arg TC:      Transmission complete
 *            @arg TXE:     Transmit buffer empty
 *            @arg PE:      Parity error
 *            @arg FE:      Framing error
 *            @arg NE:      Noise error
 *            @arg ORE:     Overrun error
 *            @arg LBD:     LIN break detection
 *            @arg CTS:     Clear To Send
 *            @arg WU:      Wake Up
 */
#define         XPD_USART_GetFlag(  HANDLE, FLAG_NAME)          \
    (((HANDLE)->Inst->ISR.w >> USART_ISR_##FLAG_NAME##_Pos) & 1)

/**
 * @brief  Clear the specified USART flag.
 * @param  HANDLE: specifies the USART Handle.
 * @param  FLAG_NAME: specifies the flag to return.
 *         This parameter can be one of the following values:
 *            @arg IDLE:    Idle
 *            @arg RXNE:    Receive buffer not empty
 *            @arg TC:      Transmission complete
 *            @arg PE:      Parity error
 *            @arg FE:      Framing error
 *            @arg NE:      Noise error
 *            @arg ORE:     Overrun error
 *            @arg LBD:     LIN break detection
 *            @arg CTS:     Clear To Send
 *            @arg WU:      Wake Up
 */
#define         XPD_USART_ClearFlag(HANDLE, FLAG_NAME)          \
    ((USART_ISR_##FLAG_NAME != USART_ISR_RXNE) ?                \
    ((HANDLE)->Inst->ICR.w = USART_ICR_##FLAG_NAME##CF) :       \
    ((HANDLE)->Inst->RQR.w = USART_RQR_RXFRQ))
#else

/**
 * @brief  Get the specified USART flag.
 * @param  HANDLE: specifies the USART Handle.
 * @param  FLAG_NAME: specifies the flag to return.
 *         This parameter can be one of the following values:
 *            @arg IDLE:    Idle
 *            @arg RXNE:    Receive buffer not empty
 *            @arg TC:      Transmission complete
 *            @arg TXE:     Transmit buffer empty
 *            @arg PE:      Parity error
 *            @arg FE:      Framing error
 *            @arg NE:      Noise error
 *            @arg ORE:     Overrun error
 *            @arg LBD:     LIN break detection
 *            @arg CTS:     Clear To Send
 */
#define         XPD_USART_GetFlag(  HANDLE, FLAG_NAME)          \
    (USART_REG_BIT((HANDLE),SR,FLAG_NAME))

/**
 * @brief  Clear the specified USART flag.
 * @param  HANDLE: specifies the USART Handle.
 * @param  FLAG_NAME: specifies the flag to return.
 *         This parameter can be one of the following values:
 *            @arg IDLE:    Idle
 *            @arg RXNE:    Receive buffer not empty
 *            @arg TC:      Transmission complete
 *            @arg TXE:     Transmit buffer empty
 *            @arg PE:      Parity error
 *            @arg FE:      Framing error
 *            @arg NE:      Noise error
 *            @arg ORE:     Overrun error
 *            @arg LBD:     LIN break detection
 *            @arg CTS:     Clear To Send
 */
#define         XPD_USART_ClearFlag(HANDLE, FLAG_NAME)          \
    do { if(USART_SR_##FLAG_NAME##_Pos <= USART_SR_RXNE_Pos)    \
       { __IO uint32_t _x_ = (HANDLE)->Inst->SR.w;              \
       _x_ = (HANDLE)->Inst->DR; } else                         \
       {(USART_REG_BIT((HANDLE),SR,FLAG_NAME) = 0);}} while(0)

