IntergatedCircuits/STM32_XPD/STM32F4_XPD/inc/xpd_usart.h
#endif /* (USART_PERIPHERAL_VERSION > 1) */

#define __XPD_USART_IDLEIECtrl(     HANDLE, NEWSTATE)           \
    (USART_REG_BIT((HANDLE),CR1,IDLEIE) = NEWSTATE)

#define __XPD_USART_RXNEIECtrl(HANDLE, NEWSTATE)                \
    (USART_REG_BIT((HANDLE),CR1,RXNEIE) = NEWSTATE)

#define __XPD_USART_TCIECtrl(HANDLE, NEWSTATE)                  \
    (USART_REG_BIT((HANDLE),CR1,TCIE) = NEWSTATE)

#define __XPD_USART_TXEIECtrl(HANDLE, NEWSTATE)                 \
    (USART_REG_BIT((HANDLE),CR1,TXEIE) = NEWSTATE)

#define __XPD_USART_PEIECtrl(HANDLE, NEWSTATE)                  \
    (USART_REG_BIT((HANDLE),CR1,PEIE) = NEWSTATE)

#define __XPD_USART_LBDIECtrl(HANDLE, NEWSTATE)                 \
    (USART_REG_BIT((HANDLE),CR2,LBDIE) = NEWSTATE)

#define __XPD_USART_EIECtrl(HANDLE, NEWSTATE)                   \
    (USART_REG_BIT((HANDLE),CR3,EIE) = NEWSTATE)

#define __XPD_USART_CTSIECtrl(HANDLE, NEWSTATE)                 \
    (USART_REG_BIT((HANDLE),CR3,CTSIE) = NEWSTATE)

#define __XPD_USART_WUIECtrl(HANDLE, NEWSTATE)                  \
    (USART_REG_BIT((HANDLE),CR3,WUFIE) = NEWSTATE)

/** @} */

/** @addtogroup USART_Common_Exported_Functions
 * @{ */
XPD_ReturnType  XPD_USART_Deinit            (USART_HandleType * husart);

void            XPD_USART_Enable            (USART_HandleType * husart);
void            XPD_USART_Disable           (USART_HandleType * husart);

XPD_ReturnType  XPD_USART_Transmit          (USART_HandleType * husart, void * TxData,
                                             uint16_t Length, uint32_t Timeout);
XPD_ReturnType  XPD_USART_Receive           (USART_HandleType * husart, void * RxData,
                                             uint16_t Length, uint32_t Timeout);
XPD_ReturnType  XPD_USART_TransmitReceive   (USART_HandleType * husart, void * TxData, void * RxData,
                                             uint16_t Length, uint32_t Timeout);

void            XPD_USART_Transmit_IT       (USART_HandleType * husart, void * TxData, uint16_t Length);
void            XPD_USART_Receive_IT        (USART_HandleType * husart, void * RxData, uint16_t Length);

void            XPD_USART_IRQHandler        (USART_HandleType * husart);

XPD_ReturnType  XPD_USART_Transmit_DMA      (USART_HandleType * husart, void * TxData, uint16_t Length);
XPD_ReturnType  XPD_USART_Receive_DMA       (USART_HandleType * husart, void * RxData, uint16_t Length);
XPD_ReturnType  XPD_USART_TransmitReceive_DMA(USART_HandleType* husart, void * TxData,
                                             void * RxData, uint16_t Length);
void            XPD_USART_Stop_DMA          (USART_HandleType * husart);

#if (USART_PERIPHERAL_VERSION > 1)
void            XPD_USART_InversionConfig   (USART_HandleType * husart, USART_InversionType Inversions);
void            XPD_USART_OverrunConfig     (USART_HandleType * husart, FunctionalState Mode);
#endif
/** @} */

/** @} */

/** @defgroup UART Universal Asynchronous Receiver-Transmitter
 * @{ */

/** @defgroup UART_Exported_Types UART Exported Types
 * @{ */

/** @brief UART flow control selection */
typedef enum
{
    UART_FLOWCONTROL_NONE    = 0, /*!< No flow control lines are used */
    UART_FLOWCONTROL_RTS     = 1, /*!< Request To Send signal is used */
    UART_FLOWCONTROL_CTS     = 2, /*!< Clear To Send signal is used */
    UART_FLOWCONTROL_RTS_CTS = 3  /*!< Request To Send and Clear To Send signals are used */
}UART_FlowControlType;

/** @brief UART setup structure */
typedef struct {
    UART_FlowControlType FlowControl;   /*!< Hardware flow control select */
    FunctionalState      OverSampling8; /*!< When the over sampling 8 is enabled (instead of 16),
                                             higher baudrate is available */
    FunctionalState      HalfDuplex;    /*!< Half-duplex communication select */
}UART_InitType;

#if (USART_PERIPHERAL_VERSION > 1)
/** @brief UART baudrate detection strategy */
typedef enum
{
    UART_BAUDRATE_FIXED = 0,            /*!< Fixed baudrate is used (auto baudrate detection is disabled) */

#ifdef USART_CR2_ABREN

    UART_BAUDRATE_AUTO_STARTBIT_MODE =  /*!< START bit is measured from falling to rising edge (D0=1) */
            USART_CR2_ABREN,
    UART_BAUDRATE_AUTO_2FALLING_MODE =  /*!< START + LSB=1 bits are measured from falling to falling edge (D0=1, D1=0) */
            USART_CR2_ABREN | USART_CR2_ABRMODE_0,

#ifdef USART_CR2_ABRMODE_1

    UART_BAUDRATE_AUTO_0X7FFRAME_MODE = /*!< START to MSB=0 bits are measured from falling to falling edge */
            USART_CR2_ABREN | USART_CR2_ABRMODE_1,
    UART_BAUDRATE_AUTO_0X55FRAME_MODE = /*!< Combination of the above methods */
            USART_CR2_ABREN | USART_CR2_ABRMODE
#endif
#endif
}UART_BaudrateModeType;
#endif

/** @} */

/** @addtogroup UART_Exported_Functions
 * @{ */
XPD_ReturnType  XPD_UART_Init               (USART_HandleType * husart, const USART_InitType * Common,
                                             const UART_InitType * Config);
#if (USART_PERIPHERAL_VERSION > 1)
void            XPD_UART_BaudrateModeConfig (USART_HandleType * husart, UART_BaudrateModeType Mode);
#endif
/** @} */

/** @} */

/** @defgroup USRT Universal Synchronous Receiver-Transmitter
 * @{ */

/** @defgroup USRT_Exported_Types USRT Exported Types
 * @{ */

/** @brief USRT setup structure */
typedef struct {
    ActiveLevelType   Polarity;      /*!< Steady state of the serial clock */
    ClockPhaseType    Phase;         /*!< The clock transition on which the bit capture is made */
    FunctionalState   LastBit;       /*!< The clock pulse for the last transmitted data bit (MSB)
                                          has to be provided */
}USRT_InitType;

/** @} */

/** @addtogroup USRT_Exported_Functions
 * @{ */
XPD_ReturnType  XPD_USRT_Init               (USART_HandleType * husart, const USART_InitType * Common,
                                             const USRT_InitType * Config);
/** @} */

/** @} */

/** @defgroup LIN Local Interconnect Network
 * @{ */

/** @addtogroup LIN_Exported_Functions
 * @{ */
XPD_ReturnType  XPD_LIN_Init                (USART_HandleType * husart, const USART_InitType * Common,
                                             uint8_t BreakSize);
void            XPD_LIN_SendBreak           (USART_HandleType * husart);
/** @} */

/** @} */

/** @defgroup MSUART MultiSlave UART Bus
 * @{ */

