IntergatedCircuits/STM32_XPD/STM32F4_XPD/inc/xpd_usart.h
/** @defgroup MSUART_Exported_Types MultiSlave UART Exported Types
 * @{ */

/** @brief MSUART wakeup from Mute selection */
typedef enum
{
    MSUART_UNMUTE_IDLE_LINE     = 0, /*!< Unmute on Idle Line */
    MSUART_UNMUTE_ADDRESSED     = 1, /*!< Unmute on matching Address Mark (address MSB = 1, data MSB = 0) */
}MSUART_UnmuteType;

#if (USART_PERIPHERAL_VERSION > 2)
/** @brief MSUART wakeup selection */
typedef enum
{
    MSUART_WAKEUP_ADDRESSED     = 1, /*!< Wakeup on matching Address Mark (address MSB = 1, data MSB = 0) */
    MSUART_WAKEUP_START_BIT     = 2, /*!< Wakeup on Start bit detection */
    MSUART_WAKEUP_DATA_RECEIVED = 3, /*!< Wakeup on RXNE flag */
}MSUART_WakeUpType;
#endif

/** @brief MSUART setup structure */
typedef struct {
    FunctionalState      OverSampling8;     /*!< When the over sampling 8 is enabled (instead of 16),
                                                 higher baudrate is available */
    FunctionalState      HalfDuplex;        /*!< Half-duplex communication select */
    uint8_t              Address;           /*!< Specifies the slave device address */
    uint8_t              AddressLength;     /*!< Specifies the address length (default 4 or 7 bits) */
    MSUART_UnmuteType    UnmuteMethod;      /*!< Specifies the activation strategy from Mute */

#if (USART_PERIPHERAL_VERSION > 2)
    MSUART_WakeUpType    WakeUpMethod;      /*!< Specifies the activation strategy from STOP mode */
#endif
}MSUART_InitType;
/** @} */

/** @addtogroup MSUART_Exported_Functions
 * @{ */
XPD_ReturnType  XPD_MSUART_Init             (USART_HandleType * husart, const USART_InitType * Common,
                                             const MSUART_InitType * Config);
void            XPD_MSUART_MuteCtrl         (USART_HandleType * husart, FunctionalState NewState);

#if (USART_PERIPHERAL_VERSION > 2)
void            XPD_MSUART_StopModeCtrl     (USART_HandleType * husart, FunctionalState NewState);
#endif
/** @} */

/** @} */

/** @defgroup SmartCard SmartCard interface
 * @{ */

/** @defgroup SmartCard_Exported_Types SmartCard Exported Types
 * @{ */

/** @brief SmartCard setup structure */
typedef struct
{
    uint8_t         GuardTime;    /*!< Delays the raising of TC flag by a number of baud clocks */
    FunctionalState NACK;         /*!< Enable to force frame error at the end of received frame
                                       with detected parity error */
    struct {
        ActiveLevelType Polarity; /*!< Steady state of the serial clock */
        ClockPhaseType  Phase;    /*!< The clock transition on which the bit capture is made */
        uint8_t         Divider;  /*!< Prescaler value that divides the peripheral clock
                                       before SCLK output [2, 4, ... 62] */
    }Clock;                       /*   Output clock settings */

#if (USART_PERIPHERAL_VERSION > 1)
    uint32_t        RxTimeout;    /*!< Specifies the receiver timeout value in baud block count for
                                       Character Wait Time (CWT) and Block Wait Time (BWT). Set to 0 to disable. */
    uint8_t         BlockLength;  /*!< Specifies the SmartCard Block Length in T = 1 Reception mode */
    uint8_t         AutoRetries;  /*!< Specifies the number of retries in receive and transmit mode
                                       before reaching error state [0..7] */
#endif
}SmartCard_InitType;
/** @} */

/** @addtogroup SmartCard_Exported_Functions
 * @{ */
XPD_ReturnType  XPD_SmartCard_Init          (USART_HandleType * husart, const USART_InitType * Common,
                                             const SmartCard_InitType * Config);
/** @} */

/** @} */

/** @defgroup IrDA IrDA interface
 * @{ */

/** @defgroup IrDA_Exported_Types IrDA Exported Types
 * @{ */

/** @brief IrDA setup structure */
typedef struct
{
    uint8_t         Prescaler;    /*!< The prescaler provides time base for pulse detection (pulse > 2*tPrescaler) */
    FunctionalState LowPowerMode; /*!< Low power mode - different modulation scheme */
}IrDA_InitType;

/** @addtogroup IrDA_Exported_Functions
 * @{ */
XPD_ReturnType  XPD_IrDA_Init               (USART_HandleType * husart, const USART_InitType * Common,
                                             const IrDA_InitType * Config);
/** @} */

/** @} */

#if (USART_PERIPHERAL_VERSION > 1)
/** @defgroup RS485 RS485 interface
 * @{ */

/** @defgroup RS485_Exported_Types RS485 Exported Types
 * @{ */

/** @brief RS485 setup structure */
typedef struct
{
    FunctionalState      OverSampling8;   /*!< When the over sampling 8 is enabled (instead of 16),
                                               higher baudrate is available */
    FunctionalState      HalfDuplex;      /*!< Half-duplex communication select */
    struct {
        ActiveLevelType  Polarity;        /*!< Polarity of the Driver Enable signal */
        uint8_t          AssertionTime;   /*!< The time between the activation of the DE signal
                                               and the beginning of the start bit in sample time units */
        uint8_t          DeassertionTime; /*!< The time between the end of the last transmitted stop bit and the
                                               deactivation of the DE (Driver Enable) signal in sample time units */
    }DE;                                  /*   Driver Enable signal configuration */
}RS485_InitType;

/** @addtogroup RS485_Exported_Functions
 * @{ */
XPD_ReturnType  XPD_RS485_Init              (USART_HandleType * husart, const USART_InitType * Common,
                                             const RS485_InitType * Config);
/** @} */

/** @} */
#endif

/** @} */

#define XPD_USART_API
#include "xpd_rcc_gen.h"
#include "xpd_rcc_pc.h"
#undef XPD_USART_API

#endif /* __XPD_USART_H_ */
